cv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CV</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">CV</h1>

<div id="outline-container-orgcf49f4f" class="outline-2">
<h2 id="orgcf49f4f">Mikko Kolehmainen</h2>
<div class="outline-text-2" id="text-orgcf49f4f">
</div>
<div id="outline-container-org900066f" class="outline-4">
<h4 id="org900066f">Programmer, developer and problem solver</h4>
</div>
</div>

<div id="outline-container-orga751c89" class="outline-2">
<h2 id="orga751c89">Education</h2>
<div class="outline-text-2" id="text-orga751c89">
</div>
<ul class="org-ul">
<li><a id="org42f55ab"></a><b>Aalto University, Sound in New Media</b><br />
<div class="outline-text-5" id="text-org42f55ab">
<p>
Master of Arts degree in interactive sound design including game design and computer science studies. Master’s thesis on topic “How to optimize the implementation process and data management in game audio production” (2020).
</p>
</div>
</li>

<li><a id="orgfe0c08c"></a><b>Helsinki University of Arts, Sibelius-Academy</b><br />
<div class="outline-text-5" id="text-orgfe0c08c">
<p>
Bachelor of Music (2016), Music and Technology department
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-orgb3864cd" class="outline-2">
<h2 id="orgb3864cd">Work history</h2>
<div class="outline-text-2" id="text-orgb3864cd">
<p>
Working as a audio programmer at <b>Rovio Entertainment</b> (2021-).
</p>

<p>
Worked as a junior audio programmer at <b>Remedy Entertainment</b> (2020-2021) on unannounced game project and internal development. Co-designing and programming features for in-house game engine Northlight, maintaining audio code base and middleware integration, but also developing custom tools for the audio pipeline.
</p>

<p>
Worked as an technical audio designer at <b>Remedy Entertainment</b> (2018-2020) on titles Control and Crossfire X (PC, PS4, Xbox). Music implementation, system design, implementation and audio optimization on game projects, but also development and programming of internal tools. Mostly working with in-house game engine Northlight and Audiokinetic Wwise.
</p>

<p>
Worked as principal sound designer for <b>Convict games</b> (2018) on a title Stone (PC, Mac, Xbox, Nintendo Switch). Work involved organizing, directing and executing voice-over sessions in Finland and Australia, sound design, implementation with Unreal Engine.
</p>

<p>
Worked as sound designer for <b>3rd Eye Studios</b> (2017-2018) on title Downward Spiral (PS4, PSVR, PC and Oculus). Work involved sound design, implementation with custom cross-platform audio tools for Unity.
</p>
</div>

<div id="outline-container-org6e71013" class="outline-3">
<h3 id="org6e71013">Developing software tools</h3>
<div class="outline-text-3" id="text-org6e71013">
<p>
Variety of tools, standalone applications and extensions for 3rd party software such as <b>Unity</b>,  Audiokinetic <b>Wwise</b> and Cockos <b>Reaper</b>. Some examples: automated implementation and asset management extension for Wwise, dialogue/ADR recording software, code reference finder, version control and automation extensions for Reaper.
</p>

<p>
Personal projects include file encryption tools, file finding and parsing tools, customizing linux systems and scripting, signal processing tools, generative music sofware and random projects with Arduino with wide selection of sensors.
</p>
</div>
</div>

<div id="outline-container-org7fd80eb" class="outline-3">
<h3 id="org7fd80eb">Skills</h3>
<div class="outline-text-3" id="text-org7fd80eb">
<p>
Professional experience with <b>C++</b>, <b>C#</b>, <b>Python</b> and <b>Lua</b>, and personal projects additionally <b>Go</b>, <b>Elisp</b>, and scripting languages.
</p>

<p>
Solid understanding of editors and software development tools such as <b>Vim</b>, <b>Emacs</b>, Visual Studio, <b>Pycharm</b>, Rider, <b>Git</b> and Perforce.
</p>

<p>
Experience with setting up and using operating systems such as <b>Arch linux</b>, Kali linux, <b>Qubes Os</b>, <b>Ubuntu</b>, <b>MacOS</b>, Microsoft Windows, iOS, Android and <b>GrapheneOS</b>.
</p>

<p>
Basic knowledge of self-hosted servers, networking, NAS setups and cloud services such as AWS and Google Cloud, but also embedded development with <b>Raspberry Pi</b>, Teensy, Arduino and other electronics.
</p>

<p>
Great team working and communication skills both in English and Finnish.
</p>
</div>
</div>

<div id="outline-container-org7b8b826" class="outline-3">
<h3 id="org7b8b826">Freetime</h3>
<div class="outline-text-3" id="text-org7b8b826">
<p>
Outside of work, I'm interested in a number of things e.g. music, DIY, board/video games and climbing.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
